FrontEnd/src/conf/xml-resources/web-service-references/IMBService/wsdl/localhost_8080/IMBService/IMBService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.3.2-b608 (trunk-7979; 2015-01-21T12:50:19+0000) JAXWS-RI/2.2.11-b150120.1832 JAXWS-API/2.2.12 JAXB-RI/2.2.12-b141219.1637 JAXB-API/2.2.13-b141020.1521 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://Service/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://Service/" name="IMBService">
<types>
<xsd:schema>
<xsd:import namespace="http://Service/" schemaLocation="http://localhost:8080/IMBService/IMBService?xsd=1"/>
</xsd:schema>
</types>
<message name="IMB">
<part name="parameters" element="tns:IMB"/>
</message>
<message name="IMBResponse">
<part name="parameters" element="tns:IMBResponse"/>
</message>
<portType name="IMBService">
<operation name="IMB">
<input wsam:Action="http://Service/IMBService/IMBRequest" message="tns:IMB"/>
<output wsam:Action="http://Service/IMBService/IMBResponse" message="tns:IMBResponse"/>
</operation>
</portType>
<binding name="IMBServicePortBinding" type="tns:IMBService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="IMB">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="IMBService">
<port name="IMBServicePort" binding="tns:IMBServicePortBinding">
<soap:address location="http://localhost:8080/IMBService/IMBService"/>
</port>
</service>
</definitions>